zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/m0p/hw_debugss.h
/*—————————————————————————————————————————————————————————————————————————————
 * TXCTL (调试发送控制寄存器)
 * 指示TXD数据就绪状态，软件读取TXD后自动清除
 *—————————————————————————————————————————————————————————————————————————————*/
/* DEBUGSS_TXCTL[TRANSMIT] — 发送状态 [0] */
#define DEBUGSS_TXCTL_TRANSMIT_OFS               (0)                             /* !< TRANSMIT Offset */
#define DEBUGSS_TXCTL_TRANSMIT_MASK              ((uint32_t)0x00000001U)         /* !< TXD数据就绪标志，软件读TXD后自动清除 */
#define DEBUGSS_TXCTL_TRANSMIT_EMPTY             ((uint32_t)0x00000000U)         /* !< TXD为空 (无数据) */
#define DEBUGSS_TXCTL_TRANSMIT_FULL              ((uint32_t)0x00000001U)         /* !< TXD已满 (有数据待读) */
/* DEBUGSS_TXCTL[TRANSMIT_FLAGS] — 通用发送标志 [31:1] */
#define DEBUGSS_TXCTL_TRANSMIT_FLAGS_OFS         (1)                             /* !< TRANSMIT_FLAGS Offset */
#define DEBUGSS_TXCTL_TRANSMIT_FLAGS_MASK        ((uint32_t)0xFFFFFFFEU)         /* !< 通用TX标志，由外部调试工具设置，功能由软件定义 */

/*—————————————————————————————————————————————————————————————————————————————
 * RXD (调试接收数据寄存器，读写)
 * 软件写入数据，外部调试工具通过SWD读取
 *—————————————————————————————————————————————————————————————————————————————*/
/* DEBUGSS_RXD[RX_DATA] — 接收数据 [31:0] */
#define DEBUGSS_RXD_RX_DATA_OFS                  (0)                             /* !< RX_DATA Offset */
#define DEBUGSS_RXD_RX_DATA_MASK                 ((uint32_t)0xFFFFFFFFU)         /* !< 软件写入的32位数据 */

/*—————————————————————————————————————————————————————————————————————————————
 * RXCTL (调试接收控制寄存器)
 * 指示RXD数据就绪状态，SWD AP读取RXD后自动清除
 *—————————————————————————————————————————————————————————————————————————————*/
/* DEBUGSS_RXCTL[RECEIVE] — 接收状态 [0] */
#define DEBUGSS_RXCTL_RECEIVE_OFS                (0)                             /* !< RECEIVE Offset */
#define DEBUGSS_RXCTL_RECEIVE_MASK               ((uint32_t)0x00000001U)         /* !< RXD数据就绪标志，SWD AP读取后自动清除 */
#define DEBUGSS_RXCTL_RECEIVE_EMPTY              ((uint32_t)0x00000000U)         /* !< RXD为空 (无数据) */
#define DEBUGSS_RXCTL_RECEIVE_FULL               ((uint32_t)0x00000001U)         /* !< RXD已满 (有数据待读) */
/* DEBUGSS_RXCTL[RECEIVE_FLAGS] — 通用接收标志 [7:1] */
#define DEBUGSS_RXCTL_RECEIVE_FLAGS_OFS          (1)                             /* !< RECEIVE_FLAGS Offset */
#define DEBUGSS_RXCTL_RECEIVE_FLAGS_MASK         ((uint32_t)0x000000FEU)         /* !< 通用RX标志，由软件设置，外部调试工具读取 */

/*—————————————————————————————————————————————————————————————————————————————
 * SPECIAL_AUTH (特殊调试端口授权寄存器，只读)
 * 控制各调试访问端口 (AP) 的使能状态
 * 禁用时DAPBUS防火墙将隔离对应AP
 *—————————————————————————————————————————————————————————————————————————————*/
/* DEBUGSS_SPECIAL_AUTH[SECAPEN] — 安全AP使能 [0] */
#define DEBUGSS_SPECIAL_AUTH_SECAPEN_OFS         (0)                             /* !< SECAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_SECAPEN_MASK        ((uint32_t)0x00000001U)         /* !< SEC-AP使能，需同时允许SWD访问 */
#define DEBUGSS_SPECIAL_AUTH_SECAPEN_DISABLE     ((uint32_t)0x00000000U)         /* !< 禁用SEC-AP */
#define DEBUGSS_SPECIAL_AUTH_SECAPEN_ENABLE      ((uint32_t)0x00000001U)         /* !< 启用SEC-AP */
/* DEBUGSS_SPECIAL_AUTH[SWDPORTEN] — SWD端口使能 [1] */
#define DEBUGSS_SPECIAL_AUTH_SWDPORTEN_OFS       (1)                             /* !< SWDPORTEN Offset */
#define DEBUGSS_SPECIAL_AUTH_SWDPORTEN_MASK      ((uint32_t)0x00000002U)         /* !< SWD端口使能，禁用后禁止所有外部调试访问 */
#define DEBUGSS_SPECIAL_AUTH_SWDPORTEN_DISABLE   ((uint32_t)0x00000000U)         /* !< 禁用SWD端口 */
#define DEBUGSS_SPECIAL_AUTH_SWDPORTEN_ENABLE    ((uint32_t)0x00000002U)         /* !< 启用SWD端口 */
/* DEBUGSS_SPECIAL_AUTH[DFTAPEN] — DFT-AP使能 [2] */
#define DEBUGSS_SPECIAL_AUTH_DFTAPEN_OFS         (2)                             /* !< DFTAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_DFTAPEN_MASK        ((uint32_t)0x00000004U)         /* !< DFT-AP使能 (可测试性设计访问端口) */
#define DEBUGSS_SPECIAL_AUTH_DFTAPEN_DISABLE     ((uint32_t)0x00000000U)         /* !< 禁用DFT-AP */
#define DEBUGSS_SPECIAL_AUTH_DFTAPEN_ENABLE      ((uint32_t)0x00000004U)         /* !< 启用DFT-AP */
/* DEBUGSS_SPECIAL_AUTH[ETAPEN] — ET-AP使能 [3] */
#define DEBUGSS_SPECIAL_AUTH_ETAPEN_OFS          (3)                             /* !< ETAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_ETAPEN_MASK         ((uint32_t)0x00000008U)         /* !< ET-AP使能 (嵌入式追踪访问端口) */
#define DEBUGSS_SPECIAL_AUTH_ETAPEN_DISABLE      ((uint32_t)0x00000000U)         /* !< 禁用ET-AP */
#define DEBUGSS_SPECIAL_AUTH_ETAPEN_ENABLE       ((uint32_t)0x00000008U)         /* !< 启用ET-AP */
/* DEBUGSS_SPECIAL_AUTH[CFGAPEN] — CFG-AP使能 [4] */
#define DEBUGSS_SPECIAL_AUTH_CFGAPEN_OFS         (4)                             /* !< CFGAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_CFGAPEN_MASK        ((uint32_t)0x00000010U)         /* !< CFG-AP使能 (配置访问端口，读取设备配置) */
#define DEBUGSS_SPECIAL_AUTH_CFGAPEN_DISABLE     ((uint32_t)0x00000000U)         /* !< 禁用CFG-AP */
#define DEBUGSS_SPECIAL_AUTH_CFGAPEN_ENABLE      ((uint32_t)0x00000010U)         /* !< 启用CFG-AP */
/* DEBUGSS_SPECIAL_AUTH[AHBAPEN] — AHB-AP使能 [5] */
#define DEBUGSS_SPECIAL_AUTH_AHBAPEN_OFS         (5)                             /* !< AHBAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_AHBAPEN_MASK        ((uint32_t)0x00000020U)         /* !< AHB-AP使能 (通过DAP总线隔离控制M0+ Core调试访问) */
#define DEBUGSS_SPECIAL_AUTH_AHBAPEN_DISABLE     ((uint32_t)0x00000000U)         /* !< 禁用AHB-AP */
#define DEBUGSS_SPECIAL_AUTH_AHBAPEN_ENABLE      ((uint32_t)0x00000020U)         /* !< 启用AHB-AP */
/* DEBUGSS_SPECIAL_AUTH[PWRAPEN] — PWR-AP使能 [6] */
#define DEBUGSS_SPECIAL_AUTH_PWRAPEN_OFS         (6)                             /* !< PWRAPEN Offset */
#define DEBUGSS_SPECIAL_AUTH_PWRAPEN_MASK        ((uint32_t)0x00000040U)         /* !< PWR-AP使能 (电源/复位状态访问端口) */
#define DEBUGSS_SPECIAL_AUTH_PWRAPEN_DISABLE     ((uint32_t)0x00000000U)         /* !< 禁用PWR-AP */
#define DEBUGSS_SPECIAL_AUTH_PWRAPEN_ENABLE      ((uint32_t)0x00000040U)         /* !< 启用PWR-AP */

/*—————————————————————————————————————————————————————————————————————————————
 * APP_AUTH (应用调试授权寄存器，只读)
 * 控制CPU0的调试权限: 侵入式/非侵入式、安全/非安全调试
 *—————————————————————————————————————————————————————————————————————————————*/
/* DEBUGSS_APP_AUTH[DBGEN] — 侵入式调试使能 [0] */
#define DEBUGSS_APP_AUTH_DBGEN_OFS               (0)                             /* !< DBGEN Offset */
#define DEBUGSS_APP_AUTH_DBGEN_MASK              ((uint32_t)0x00000001U)         /* !< 侵入式调试使能 (断点/单步等) */
#define DEBUGSS_APP_AUTH_DBGEN_DISABLE           ((uint32_t)0x00000000U)         /* !< 禁用侵入式调试 */
#define DEBUGSS_APP_AUTH_DBGEN_ENABLE            ((uint32_t)0x00000001U)         /* !< 启用侵入式调试 */
/* DEBUGSS_APP_AUTH[NIDEN] — 非侵入式调试使能 [1] */
#define DEBUGSS_APP_AUTH_NIDEN_OFS               (1)                             /* !< NIDEN Offset */
#define DEBUGSS_APP_AUTH_NIDEN_MASK              ((uint32_t)0x00000002U)         /* !< 非侵入式调试使能 (ETM跟踪等) */
#define DEBUGSS_APP_AUTH_NIDEN_DISABLE           ((uint32_t)0x00000000U)         /* !< 禁用非侵入式调试 */
#define DEBUGSS_APP_AUTH_NIDEN_ENABLE            ((uint32_t)0x00000002U)         /* !< 启用非侵入式调试 */
/* DEBUGSS_APP_AUTH[SPIDEN] — 安全侵入式调试使能 [2] */
#define DEBUGSS_APP_AUTH_SPIDEN_OFS              (2)                             /* !< SPIDEN Offset */
#define DEBUGSS_APP_AUTH_SPIDEN_MASK             ((uint32_t)0x00000004U)         /* !< 安全侵入式调试使能 */
#define DEBUGSS_APP_AUTH_SPIDEN_DISABLE          ((uint32_t)0x00000000U)         /* !< 禁用安全侵入式调试 */
#define DEBUGSS_APP_AUTH_SPIDEN_ENABLE           ((uint32_t)0x00000004U)         /* !< 启用安全侵入式调试 */
/* DEBUGSS_APP_AUTH[SPNIDEN] — 安全非侵入式调试使能 [3] */
#define DEBUGSS_APP_AUTH_SPNIDEN_OFS             (3)                             /* !< SPNIDEN Offset */
#define DEBUGSS_APP_AUTH_SPNIDEN_MASK            ((uint32_t)0x00000008U)         /* !< 安全非侵入式调试使能 */
#define DEBUGSS_APP_AUTH_SPNIDEN_DISABLE         ((uint32_t)0x00000000U)         /* !< 禁用安全非侵入式调试 */
#define DEBUGSS_APP_AUTH_SPNIDEN_ENABLE          ((uint32_t)0x00000008U)         /* !< 启用安全非侵入式调试 */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_m0p_hw_debugss__include */
